In [1]:
#1
import pandas as pd
df=pd.read_csv("Cutlets.csv")
df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [3]:
df["Unit A"].mean()

7.0190914285714285

In [4]:
df["Unit B"].mean()

6.964297142857142

In [6]:
from scipy import stats
zcal,pvalue=stats.ttest_ind(df['Unit A'],df['Unit B'])
print("Two sample Z test or t test is performed")
print("z value=",zcal)
print("pvalue=",pvalue)
alpha=0.05
if pvalue<alpha:
    print("H0 is rejected and H1 is accepted")
else:
    print("H1 is rejected and H0 is accepted")

Two sample Z test or t test is performed
z value= 0.7228688704678063
pvalue= 0.4722394724599501
H1 is rejected and H0 is accepted

In [ ]:
#H0 is accepted , there is no significant difference in the diameter of the cutlet between two units

In [46]:
#2
import pandas as pd
df=pd.read_csv("LabTAT.csv")
df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [47]:
import scipy.stats as ftable
ft=ftable.f(dfn=4,dfd=120)

In [40]:
df["Laboratory 1"].mean()

178.36158333333336

In [41]:
df["Laboratory 2"].mean()

178.9029166666667

In [42]:
df["Laboratory 3"].mean()

199.91324999999998

In [43]:
df["Laboratory 4"].mean()

163.68275

In [45]:
df.shape

(120, 4)

In [49]:
from scipy import stats
stats,p = stats.f_oneway(df["Laboratory 1"],df["Laboratory 2"],df["Laboratory 3"],df["Laboratory 4"])
stats,p

(118.70421654401437, 2.1156708949992414e-57)

In [50]:
if p<alpha:
    print("H0 is rejected and H1 is accepted")
else:
    print("H1 is rejected and H0 is accepted")

H0 is rejected and H1 is accepted

In [ ]:
#H1 is accepted,which means there is any difference in average TAT among the different laboratories

In [28]:
#3
import pandas as pd
df=pd.read_csv("BuyerRatio.csv")
df

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [29]:
t1=sum(df["East"][df["Observed Values"]=='Males'])

In [30]:
t1

50

In [31]:
t2=sum(df["West"][df["Observed Values"]=='Males'])
t2

142

In [32]:
t3=sum(df["North"][df["Observed Values"]=='Males'])
t3

131

In [33]:
t4=sum(df["South"][df["Observed Values"]=='Males'])
t4

70

In [37]:
MT=t1+t2+t3+t4
MT

393

In [38]:
s1=sum(df["East"][df["Observed Values"]=='Females'])
s1

435

In [39]:
s2=sum(df["West"][df["Observed Values"]=='Females'])
s2

1523

In [40]:
s3=sum(df["North"][df["Observed Values"]=='Females'])
s3

1356

In [41]:
s4=sum(df["South"][df["Observed Values"]=='Females'])
s4

750

In [42]:
FT=s1+s2+s3+s4
FT

4064

In [43]:
Tot=MT+FT
Tot

4457

In [44]:
import numpy as np
props=np.array([MT/Tot,FT/Tot])
sampsize=np.array([4,4])

In [45]:
from statsmodels.stats.proportion import proportions_ztest
z,p=proportions_ztest(props,sampsize)
print("zcal=",z)
print("pvalue=",p)
alpha=0.05
if p<alpha:
    print("H0 is rejected and H1 is accepted")
else:
    print("H1 is rejected and H0 is accepted")

zcal= -0.8805169567516354
pvalue= 0.3785793233386694
H1 is rejected and H0 is accepted

In [ ]:
#H0 is accepted ,which means all proportions are equal

In [14]:
#4
import pandas as pd
df=pd.read_csv("Costomer+OrderForm.csv")
df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [15]:
Phillippines = pd.DataFrame(df['Phillippines'].value_counts())
Phillippines.columns = ['Phillippines']
Phillippines

              Phillippines
Phillippines
Error Free             271
Defective               29

In [16]:
Indonesia = pd.DataFrame(df['Indonesia'].value_counts())
Indonesia.columns = ['Indonesia']
Indonesia

            Indonesia
Indonesia
Error Free        267
Defective          33

In [17]:
t1=pd.concat([Phillippines,Indonesia],axis=1)
t1

            Phillippines  Indonesia
Error Free           271        267
Defective             29         33

In [18]:
Malta = pd.DataFrame(df['Malta'].value_counts())
Malta.columns = ['Malta']
Malta

            Malta
Malta
Error Free    269
Defective      31

In [19]:
India = pd.DataFrame(df['India'].value_counts())
India.columns = ['India']
India

            India
India
Error Free    280
Defective      20

In [20]:
t2=pd.concat([Malta,India],axis=1)
t2

            Malta  India
Error Free    269    280
Defective      31     20

In [21]:
T=pd.concat([t1,t2],axis=1)
T

            Phillippines  Indonesia  Malta  India
Error Free           271        267    269    280
Defective             29         33     31     20

In [4]:
from scipy.stats import chi2_contingency

In [25]:
chi2,p,dof,expect=chi2_contingency(T)
chi2,p,dof,expect

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))

In [24]:
pvalue=0.2771
alpha=0.05
if pvalue<alpha:
    print("H0 is rejected and H1 is accepted")
else:
    print("H1 is rejected and H0 is accepted")

H1 is rejected and H0 is accepted

In [ ]:
#H0 is accepted ,which means the variables are independent